samimasad/STE-LPC1768-/lpc17xx.cmsis.driver.library/Examples/FreeRTOS/CORTEX_LPC1768_GCC_RedSuite/LCD/LPC17xx_olddefs.h
/******************************************************************************
 *   LPC17xx.h:  Header file for NXP LPC17xx Cortex-M3 Family Microprocessors
 *   The header file is the super set of all hardware definitions of the 
 *   peripherals for the LPC17xx/24xx microprocessor.
 *
 *   Copyright(C) 2006-2008, NXP Semiconductor
 *   All rights reserved.
 *
 *   History
 *
******************************************************************************/

#ifndef __LPC17xx_H
#define __LPC17xx_H

//#include "sysdefs.h"

#define SRAM_BASE_LOCAL       ((unsigned long)0x10000000)   // 32 Kb
#define SRAM_BASE_AHB         ((unsigned long)0x20000000)	// 32 Kb

/* System Control Space memory map */
#ifndef SCS_BASE
	#define SCS_BASE              ((unsigned long)0xE000E000)
#endif

#define SysTick_BASE          (SCS_BASE + 0x0010)
#define NVIC_BASE             (SCS_BASE + 0x0100)
#define CM3_PERIPH_BASE_ADDR  (SCS_BASE + 0x0D00)

typedef struct
{
  unsigned long CPUID;
  unsigned long IRQControlState;
  unsigned long ExceptionTableOffset;
  unsigned long AIRC;
  unsigned long SysCtrl;
  unsigned long ConfigCtrl;
  unsigned long SystemPriority[3];
  unsigned long SysHandlerCtrl;
  unsigned long ConfigFaultStatus;
  unsigned long HardFaultStatus;
  unsigned long DebugFaultStatus;
  unsigned long MemoryManageFaultAddr;
  unsigned long BusFaultAddr;
} CM3_t;

/* Vector Table Base Address */
#define NVIC_VectorTable_RAM          SRAM_BASE_AHB
#define NVIC_VectorTable_FLASH        ((unsigned long)0x00000000)

#define IS_NVIC_VECTORTBL(TABLE_BASE) ((TABLE_BASE == NVIC_VectorTable_RAM) || \
                                       (TABLE_BASE == NVIC_VectorTable_FLASH))
                                  
/* Pin Connect Block */
#define PINSEL_BASE_ADDR	0x4002C000
#define PINSEL0        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x00))
#define PINSEL1        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x04))
#define PINSEL2        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x08))
#define PINSEL3        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x0C))
#define PINSEL4        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x10))
#define PINSEL5        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x14))
#define PINSEL6        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x18))
#define PINSEL7        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x1C))
#define PINSEL8        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x20))
#define PINSEL9        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x24))
#define PINSEL10       (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x28))

#define PINMODE0        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x40))
#define PINMODE1        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x44))
#define PINMODE2        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x48))
#define PINMODE3        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x4C))
#define PINMODE4        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x50))
#define PINMODE5        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x54))
#define PINMODE6        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x58))
#define PINMODE7        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x5C))
#define PINMODE8        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x60))
#define PINMODE9        (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x64))

/* Open drain mode control */
#define PINMODE_OD0     (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x68))
#define PINMODE_OD1     (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x6C))
#define PINMODE_OD2     (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x70))
#define PINMODE_OD3     (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x74))
#define PINMODE_OD4     (*(volatile unsigned long *)(PINSEL_BASE_ADDR + 0x78))

#define PINSEL0_P00_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P00_TXD0      ((unsigned int) 0x00000001)
#define PINSEL0_P00_PWM1      ((unsigned int) 0x00000002)
#define PINSEL0_P00_RSVD3     ((unsigned int) 0x00000003)
#define PINSEL0_P00_MASK      ((unsigned int) 0x00000003)

#define PINSEL0_P01_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P01_RXD0      ((unsigned int) 0x00000004)
#define PINSEL0_P01_PWM3      ((unsigned int) 0x00000008)
#define PINSEL0_P01_EINT0     ((unsigned int) 0x0000000C)
#define PINSEL0_P01_MASK      ((unsigned int) 0x0000000C)

#define PINSEL0_P02_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P02_SCL0      ((unsigned int) 0x00000010)
#define PINSEL0_P02_CAP00     ((unsigned int) 0x00000020)
#define PINSEL0_P02_RSVD3     ((unsigned int) 0x00000030)
#define PINSEL0_P02_MASK      ((unsigned int) 0x00000030)

#define PINSEL0_P03_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P03_SDA0      ((unsigned int) 0x00000040)
#define PINSEL0_P03_MAT00     ((unsigned int) 0x00000080)
#define PINSEL0_P03_EINT1     ((unsigned int) 0x000000C0)
#define PINSEL0_P03_MASK      ((unsigned int) 0x000000C0)

#define PINSEL0_P04_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P04_SCK0      ((unsigned int) 0x00000100)
#define PINSEL0_P04_CAP01     ((unsigned int) 0x00000200)
#define PINSEL0_P04_RSVD3     ((unsigned int) 0x00000300)
#define PINSEL0_P04_MASK      ((unsigned int) 0x00000300)

#define PINSEL0_P05_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P05_MISO0     ((unsigned int) 0x00000400)
#define PINSEL0_P05_MAT01     ((unsigned int) 0x00000800)
#define PINSEL0_P05_AD06      ((unsigned int) 0x00000C00)
#define PINSEL0_P05_MASK      ((unsigned int) 0x00000C00)

#define PINSEL0_P06_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P06_MOSI0     ((unsigned int) 0x00001000)
#define PINSEL0_P06_CAP02     ((unsigned int) 0x00002000)
#define PINSEL0_P06_AD10      ((unsigned int) 0x00003000)
#define PINSEL0_P06_MASK      ((unsigned int) 0x00003000)

#define PINSEL0_P07_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P07_SSEL0     ((unsigned int) 0x00004000)
#define PINSEL0_P07_PWM2      ((unsigned int) 0x00008000)
#define PINSEL0_P07_EINT2     ((unsigned int) 0x0000C000)
#define PINSEL0_P07_MASK      ((unsigned int) 0x0000C000)

