samimasad/STE-LPC1768-/lpc17xx.cmsis.driver.library/Examples/FreeRTOS/CORTEX_LPC1768_GCC_RedSuite/LCD/LPC17xx_olddefs.h
#define PINSEL0_P08_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P08_TXD1      ((unsigned int) 0x00010000)
#define PINSEL0_P08_PWM4      ((unsigned int) 0x00020000)
#define PINSEL0_P08_AD11      ((unsigned int) 0x00030000)
#define PINSEL0_P08_MASK      ((unsigned int) 0x00030000)

#define PINSEL0_P09_GPIO      ((unsigned int) 0x00000000)
#define PINSEL0_P09_RXD1      ((unsigned int) 0x00040000)
#define PINSEL0_P09_PWM6      ((unsigned int) 0x00080000)
#define PINSEL0_P09_EINT3     ((unsigned int) 0x000C0000)
#define PINSEL0_P09_MASK      ((unsigned int) 0x000C0000)

#define PINSEL0_P010_GPIO     ((unsigned int) 0x00000000)
#define PINSEL0_P010_RTS1     ((unsigned int) 0x00100000)
#define PINSEL0_P010_CAP10    ((unsigned int) 0x00200000)
#define PINSEL0_P010_AD12     ((unsigned int) 0x00300000)
#define PINSEL0_P010_MASK     ((unsigned int) 0x00300000)

#define PINSEL0_P011_GPIO     ((unsigned int) 0x00000000)
#define PINSEL0_P011_CTS1     ((unsigned int) 0x00400000)
#define PINSEL0_P011_CAP11    ((unsigned int) 0x00800000)
#define PINSEL0_P011_SCL1     ((unsigned int) 0x00C00000)
#define PINSEL0_P011_MASK     ((unsigned int) 0x00C00000)

#define PINSEL0_P012_GPIO     ((unsigned int) 0x00000000)
#define PINSEL0_P012_DSR1     ((unsigned int) 0x01000000)
#define PINSEL0_P012_MAT10    ((unsigned int) 0x02000000)
#define PINSEL0_P012_AD13     ((unsigned int) 0x03000000)
#define PINSEL0_P012_MASK     ((unsigned int) 0x03000000)

#define PINSEL0_P013_GPIO     ((unsigned int) 0x00000000)
#define PINSEL0_P013_DTR1     ((unsigned int) 0x04000000)
#define PINSEL0_P013_MAT11    ((unsigned int) 0x08000000)
#define PINSEL0_P013_AD14     ((unsigned int) 0x0C000000)
#define PINSEL0_P013_MASK     ((unsigned int) 0x0C000000)

#define PINSEL0_P014_GPIO     ((unsigned int) 0x00000000)
#define PINSEL0_P014_DCD1     ((unsigned int) 0x10000000)
#define PINSEL0_P014_EINT1    ((unsigned int) 0x20000000)
#define PINSEL0_P014_SDA1     ((unsigned int) 0x30000000)
#define PINSEL0_P014_MASK     ((unsigned int) 0x30000000)

#define PINSEL0_P015_GPIO     ((unsigned int) 0x00000000)
#define PINSEL0_P015_RI1      ((unsigned int) 0x40000000)
#define PINSEL0_P015_EINT2    ((unsigned int) 0x80000000)
#define PINSEL0_P015_AD15     ((unsigned int) 0xC0000000)
#define PINSEL0_P015_MASK     ((unsigned int) 0xC0000000)

#define PINSEL1_P016_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P016_EINT0    ((unsigned int) 0x00000001)
#define PINSEL1_P016_MAT02    ((unsigned int) 0x00000002)
#define PINSEL1_P016_CAP02    ((unsigned int) 0x00000003)
#define PINSEL1_P016_MASK     ((unsigned int) 0x00000003)

#define PINSEL1_P017_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P017_CAP12    ((unsigned int) 0x00000004)
#define PINSEL1_P017_SCK1     ((unsigned int) 0x00000008)
#define PINSEL1_P017_MAT12    ((unsigned int) 0x0000000c)
#define PINSEL1_P017_MASK     ((unsigned int) 0x0000000c)

#define PINSEL1_P018_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P018_CAP13    ((unsigned int) 0x00000010)
#define PINSEL1_P018_MISO1    ((unsigned int) 0x00000020)
#define PINSEL1_P018_MAT13    ((unsigned int) 0x00000030)
#define PINSEL1_P018_MASK     ((unsigned int) 0x00000030)

#define PINSEL1_P019_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P019_MAT12    ((unsigned int) 0x00000040)
#define PINSEL1_P019_MOSI1    ((unsigned int) 0x00000080)
#define PINSEL1_P019_CAP12    ((unsigned int) 0x000000c0)

#define PINSEL1_P020_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P020_MAT13    ((unsigned int) 0x00000100)
#define PINSEL1_P020_SSEL1    ((unsigned int) 0x00000200)
#define PINSEL1_P020_EINT3    ((unsigned int) 0x00000300)
#define PINSEL1_P020_MASK     ((unsigned int) 0x00000300)

#define PINSEL1_P021_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P021_PWM5     ((unsigned int) 0x00000400)
#define PINSEL1_P021_AD16     ((unsigned int) 0x00000800)
#define PINSEL1_P021_CAP13    ((unsigned int) 0x00000c00)
#define PINSEL1_P021_MASK     ((unsigned int) 0x00000c00)

#define PINSEL1_P022_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P022_AD17     ((unsigned int) 0x00001000)
#define PINSEL1_P022_CAP00    ((unsigned int) 0x00002000)
#define PINSEL1_P022_MAT00    ((unsigned int) 0x00003000)
#define PINSEL1_P022_MASK     ((unsigned int) 0x00003000)

#define PINSEL1_P023_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P023_VBUS     ((unsigned int) 0x00004000)
#define PINSEL1_P023_RSVD2    ((unsigned int) 0x00008000)
#define PINSEL1_P023_RSVD3    ((unsigned int) 0x0000c000)
#define PINSEL1_P023_MASK     ((unsigned int) 0x0000c000)

#define PINSEL1_P024_RSVD0    ((unsigned int) 0x00000000)
#define PINSEL1_P024_RSVD1    ((unsigned int) 0x00010000)
#define PINSEL1_P024_RSVD2    ((unsigned int) 0x00020000)
#define PINSEL1_P024_RSVD3    ((unsigned int) 0x00030000)
#define PINSEL1_P024_MASK     ((unsigned int) 0x00030000)

#define PINSEL1_P025_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P025_AD04     ((unsigned int) 0x00040000)
#define PINSEL1_P025_AOUT     ((unsigned int) 0x00080000)
#define PINSEL1_P025_RSVD3    ((unsigned int) 0x000c0000)
#define PINSEL1_P025_MASK     ((unsigned int) 0x000c0000)

#define PINSEL1_P026_RSVD0    ((unsigned int) 0x00000000)
#define PINSEL1_P026_RSVD1    ((unsigned int) 0x00100000)
#define PINSEL1_P026_RSVD2    ((unsigned int) 0x00200000)
#define PINSEL1_P026_RSVD3    ((unsigned int) 0x00300000)
#define PINSEL1_P026_MASK     ((unsigned int) 0x00300000)

#define PINSEL1_P027_RSVD0    ((unsigned int) 0x00000000)
#define PINSEL1_P027_RSVD1    ((unsigned int) 0x00400000)
#define PINSEL1_P027_RSVD2    ((unsigned int) 0x00800000)
#define PINSEL1_P027_RSVD3    ((unsigned int) 0x00c00000)
#define PINSEL1_P027_MASK     ((unsigned int) 0x00c00000)

#define PINSEL1_P028_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P028_AD01     ((unsigned int) 0x01000000)
#define PINSEL1_P028_CAP02    ((unsigned int) 0x02000000)
#define PINSEL1_P028_MAT02    ((unsigned int) 0x03000000)
#define PINSEL1_P028_MASK     ((unsigned int) 0x03000000)

#define PINSEL1_P029_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P029_AD02     ((unsigned int) 0x04000000)
#define PINSEL1_P029_CAP03    ((unsigned int) 0x08000000)
#define PINSEL1_P029_MAT03    ((unsigned int) 0x0c000000)
#define PINSEL1_P029_MASK     ((unsigned int) 0x0c000000)

#define PINSEL1_P030_GPIO     ((unsigned int) 0x00000000)
#define PINSEL1_P030_AD03     ((unsigned int) 0x10000000)
#define PINSEL1_P030_EINT3    ((unsigned int) 0x20000000)
#define PINSEL1_P030_CAP00    ((unsigned int) 0x30000000)
#define PINSEL1_P030_MASK     ((unsigned int) 0x30000000)

